pikasTech/PikaPython/example/stm32f407-Arm-2D/stm32f407-Arm-2D-bar/Arm-2D/examples/watch_panel/platform/stm32f746g-discovery/startup_ARMCM7.c
/******************************************************************************
 * @file     startup_ARMCM7.c
 * @brief    CMSIS-Core(M) Device Startup File for a Cortex-M7 Device
 * @version  V2.0.3
 * @date     31. March 2020
 ******************************************************************************/
/*
 * Copyright (c) 2009-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "stm32f7xx.h"

/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;

extern __NO_RETURN void __PROGRAM_START(void);

typedef void (*VECTOR_TABLE_Type)(void);

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler  (void);
            void Default_Handler(void);

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
/* Exceptions */
void NMI_Handler            (void) __attribute__ ((weak, alias("Default_Handler")));
void HardFault_Handler      (void) __attribute__ ((weak));
void MemManage_Handler      (void) __attribute__ ((weak, alias("Default_Handler")));
void BusFault_Handler       (void) __attribute__ ((weak, alias("Default_Handler")));
void UsageFault_Handler     (void) __attribute__ ((weak, alias("Default_Handler")));
void SVC_Handler            (void) __attribute__ ((weak, alias("Default_Handler")));
void DebugMon_Handler       (void) __attribute__ ((weak, alias("Default_Handler")));
void PendSV_Handler         (void) __attribute__ ((weak, alias("Default_Handler")));

void SysTick_Handler        (void) __attribute__ ((weak));

void      WWDG_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* Window WatchDog              */                                        
void      PVD_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* PVD through EXTI Line detection */                        
void      TAMP_STAMP_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"))); /* Tamper and TimeStamps through the EXTI line */            
void      RTC_WKUP_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* RTC Wakeup through the EXTI line */                      
void      FLASH_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* FLASH                        */                                          
void      RCC_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* RCC                          */                                            
void      EXTI0_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* EXTI Line0                   */                        
void      EXTI1_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* EXTI Line1                   */                          
void      EXTI2_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* EXTI Line2                   */                          
void      EXTI3_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* EXTI Line3                   */                          
void      EXTI4_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* EXTI Line4                   */                          
void      DMA1_Stream0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 0                */                  
void      DMA1_Stream1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 1                */                   
void      DMA1_Stream2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 2                */                   
void      DMA1_Stream3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 3                */                   
void      DMA1_Stream4_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 4                */                   
void      DMA1_Stream5_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 5                */                   
void      DMA1_Stream6_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream 6                */                   
void      ADC_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* ADC1, ADC2 and ADC3s         */                   
void      CAN1_TX_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN1 TX                      */                         
void      CAN1_RX0_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN1 RX0                     */                          
void      CAN1_RX1_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN1 RX1                     */                          
void      CAN1_SCE_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN1 SCE                     */                          
void      EXTI9_5_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* External Line[9:5]s          */                          
void      TIM1_BRK_TIM9_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM1 Break and TIM9          */         
void      TIM1_UP_TIM10_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM1 Update and TIM10        */         
void      TIM1_TRG_COM_TIM11_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM1 Trigger and Commutation and TIM11 */
void      TIM1_CC_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM1 Capture Compare         */                          
void      TIM2_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM2                         */                   
void      TIM3_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM3                         */                   
void      TIM4_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM4                         */                   
void      I2C1_EV_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C1 Event                   */                          
void      I2C1_ER_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C1 Error                   */                          
void      I2C2_EV_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C2 Event                   */                          
void      I2C2_ER_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C2 Error                   */                            
void      SPI1_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI1                         */                   
void      SPI2_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI2                         */                   
void      USART1_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USART1                       */                   
void      USART2_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USART2                       */                   
void      USART3_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USART3                       */                   
void      EXTI15_10_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler"))); /* External Line[15:10]s        */                          
void      RTC_Alarm_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler"))); /* RTC Alarm (A and B) through EXTI Line */                 
void      OTG_FS_WKUP_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG FS Wakeup through EXTI line */                       
void      TIM8_BRK_TIM12_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM8 Break and TIM12         */         
void      TIM8_UP_TIM13_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM8 Update and TIM13        */         
void      TIM8_TRG_COM_TIM14_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM8 Trigger and Commutation and TIM14 */
void      TIM8_CC_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM8 Capture Compare         */                          
void      DMA1_Stream7_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA1 Stream7                 */                          
void      FMC_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* FMC                          */                   
void      SDMMC1_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* SDMMC1                       */                   
void      TIM5_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM5                         */                   
void      SPI3_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI3                         */                   
void      UART4_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* UART4                        */                   
void      UART5_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* UART5                        */                   
void      TIM6_DAC_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM6 and DAC1&2 underrun errors */                   
void      TIM7_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* TIM7                         */
void      DMA2_Stream0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 0                */                   
void      DMA2_Stream1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 1                */                   
void      DMA2_Stream2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 2                */                   
void      DMA2_Stream3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 3                */                   
void      DMA2_Stream4_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 4                */                   
void      ETH_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* Ethernet                     */                   
void      ETH_WKUP_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* Ethernet Wakeup through EXTI line */                     
void      CAN2_TX_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN2 TX                      */                          
void      CAN2_RX0_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN2 RX0                     */                          
void      CAN2_RX1_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN2 RX1                     */                          
void      CAN2_SCE_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* CAN2 SCE                     */                          
void      OTG_FS_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG FS                   */                   
void      DMA2_Stream5_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 5                */                   
void      DMA2_Stream6_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 6                */                   
void      DMA2_Stream7_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2 Stream 7                */                   
void      USART6_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USART6                       */                    
void      I2C3_EV_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C3 event                   */                          
void      I2C3_ER_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C3 error                   */                          
void      OTG_HS_EP1_OUT_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG HS End Point 1 Out   */                   
void      OTG_HS_EP1_IN_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG HS End Point 1 In    */                   
void      OTG_HS_WKUP_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG HS Wakeup through EXTI */                         
void      OTG_HS_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* USB OTG HS                   */                   
void      DCMI_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* DCMI                         */                   
              
void      RNG_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* Rng                          */
void      FPU_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* FPU                          */
void      UART7_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* UART7                        */      
void      UART8_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* UART8                        */
void      SPI4_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI4                         */
void      SPI5_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI5                           */
void      SPI6_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPI6                         */
void      SAI1_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SAI1                          */
void      LTDC_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* LTDC                          */
void      LTDC_ER_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* LTDC error                      */
void      DMA2D_IRQHandler                  (void) __attribute__ ((weak, alias("Default_Handler"))); /* DMA2D                          */
void      SAI2_IRQHandler                   (void) __attribute__ ((weak, alias("Default_Handler"))); /* SAI2                         */
void      QUADSPI_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* QUADSPI                      */
void      LPTIM1_IRQHandler                 (void) __attribute__ ((weak, alias("Default_Handler"))); /* LPTIM1                       */
void      CEC_IRQHandler                    (void) __attribute__ ((weak, alias("Default_Handler"))); /* HDMI_CEC                     */
void      I2C4_EV_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C4 Event                   */
void      I2C4_ER_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler"))); /* I2C4 Error                   */
void      SPDIF_RX_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler"))); /* SPDIF_RX                     */      


/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/

#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

extern const VECTOR_TABLE_Type __VECTOR_TABLE[240];
       const VECTOR_TABLE_Type __VECTOR_TABLE[240] __VECTOR_TABLE_ATTRIBUTE = {
  (VECTOR_TABLE_Type)(&__INITIAL_SP),       /*     Initial Stack Pointer */
  Reset_Handler,                            /*     Reset Handler */
  NMI_Handler,                              /* -14 NMI Handler */
  HardFault_Handler,                        /* -13 Hard Fault Handler */
  MemManage_Handler,                        /* -12 MPU Fault Handler */
  BusFault_Handler,                         /* -11 Bus Fault Handler */
  UsageFault_Handler,                       /* -10 Usage Fault Handler */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  SVC_Handler,                              /*  -5 SVC Handler */
  DebugMon_Handler,                         /*  -4 Debug Monitor Handler */
  0,                                        /*     Reserved */
  PendSV_Handler,                           /*  -2 PendSV Handler */
  SysTick_Handler                          /*  -1 SysTick Handler */

