pikasTech/PikaPython/example/stm32f407-Arm-2D/stm32f407-Arm-2D-bar/Arm-2D/examples/watch_panel/platform/stm32f746g-discovery/startup_ARMCM7.c
  ,     RNG_IRQHandler                    /* Rng                          */
  ,     FPU_IRQHandler                    /* FPU                          */
  ,     UART7_IRQHandler                  /* UART7                        */      
  ,     UART8_IRQHandler                  /* UART8                        */
  ,     SPI4_IRQHandler                   /* SPI4                         */
  ,     SPI5_IRQHandler                   /* SPI5                           */
  ,     SPI6_IRQHandler                   /* SPI6                         */
  ,     SAI1_IRQHandler                   /* SAI1                          */
  ,     LTDC_IRQHandler                   /* LTDC                          */
  ,     LTDC_ER_IRQHandler                /* LTDC error                      */
  ,     DMA2D_IRQHandler                  /* DMA2D                          */
  ,     SAI2_IRQHandler                   /* SAI2                         */
  ,     QUADSPI_IRQHandler                /* QUADSPI                      */
  ,     LPTIM1_IRQHandler                 /* LPTIM1                       */
  ,     CEC_IRQHandler                    /* HDMI_CEC                     */
  ,     I2C4_EV_IRQHandler                /* I2C4 Event                   */
  ,     I2C4_ER_IRQHandler                /* I2C4 Error                   */
  ,     SPDIF_RX_IRQHandler               /* SPDIF_RX                     */      
};

#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
  SystemInit();                             /* CMSIS System Initialization */
  __PROGRAM_START();                        /* Enter PreMain (C library entry point) */
}


#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif

/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
void HardFault_Handler(void)
{
  while(1);
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
  while(1);
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#endif

